---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  d:\User\private\Desktop\stata\findsj_v3\findsj_examples.log
  log type:  text
 opened on:  22 Oct 2025, 15:46:46

. 
. clear all

. set more off

. 
. dis _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. dis "FINDSJ EXAMPLES - Version 1.0.3"
FINDSJ EXAMPLES - Version 1.0.3

. dis "Searching Stata Journal Articles"
Searching Stata Journal Articles

. dis "{hline 80}" _n
--------------------------------------------------------------------------------


. 
. ********************************************************************************
. * Example 1: Basic search
. ********************************************************************************
. dis _n "{bf:Example 1: Basic search for 'panel data'}"

Example 1: Basic search for 'panel data'

. findsj panel data

------------------------------------------------------------
  Searching Stata Journal articles...
  Keywords: panel data
  Search by: keyword
------------------------------------------------------------

Found 69 article(s).

------------------------------------------------------------
  Search Results (Showing 5 of 69)
------------------------------------------------------------

[1] N. J. Cox. (2007). 
    Speaking Stata: Identifying spells
    _Stata Journal_ 7(2)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[2] P. W. Jeanty. (2010). 
    Using the world development indicators database for statistical analysis in Stata
    _Stata Journal_ 10(1)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[3] P. W. Jeanty. (2011). 
    Managing the U.S. Census 2000 and World Development Indicators databases for statistical analysis in Stata
    _Stata Journal_ 11(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[4] P. Wilner Jeanty. (2013). 
    Dealing with identifier variables in data management and analysis
    _Stata Journal_ 13(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[5] N. J. Cox. (2016). 
    Speaking Stata: Truth, falsity, indication, and negation
    _Stata Journal_ 16(1)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software

------------------------------------------------------------
  Showing 5 of 69 results.
  To see all results, add option: allresults
  Example: findsj panel data, allresults
------------------------------------------------------------

------------------------------------------------------------
  Search completed. Found 69 article(s).
  To view full search results online: Open in browser
------------------------------------------------------------


. 
. ********************************************************************************
. * Example 2: Limit number of results
. ********************************************************************************
. dis _n(2) "{bf:Example 2: Show only top 10 results}"


Example 2: Show only top 10 results

. findsj panel data, n(10)

------------------------------------------------------------
  Searching Stata Journal articles...
  Keywords: panel data
  Search by: keyword
------------------------------------------------------------

Found 69 article(s).

------------------------------------------------------------
  Search Results (Showing 10 of 69)
------------------------------------------------------------

[1] N. J. Cox. (2007). 
    Speaking Stata: Identifying spells
    _Stata Journal_ 7(2)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[2] P. W. Jeanty. (2010). 
    Using the world development indicators database for statistical analysis in Stata
    _Stata Journal_ 10(1)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[3] P. W. Jeanty. (2011). 
    Managing the U.S. Census 2000 and World Development Indicators databases for statistical analysis in Stata
    _Stata Journal_ 11(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[4] P. Wilner Jeanty. (2013). 
    Dealing with identifier variables in data management and analysis
    _Stata Journal_ 13(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[5] N. J. Cox. (2016). 
    Speaking Stata: Truth, falsity, indication, and negation
    _Stata Journal_ 16(1)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[6] N. J. Cox. (2020). 
    Speaking Stata: Is a variable constant?
    _Stata Journal_ 20(3)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[7] N. J. Cox. (2023). 
    Speaking Stata: Replacing missing values: The easiest problems
    _Stata Journal_ 23(3)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[8] S. Kripfganz. (2023). 
    Review of A. Colin Cameron and Pravin K. Trivedi's Microeconometrics Using Stata, Second Edition
    _Stata Journal_ 23(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[9] N. J. Cox. (2004). 
    Speaking Stata: Graphing agreement and disagreement
    _Stata Journal_ 4(3)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[10] N. J. Cox. (2009). 
    Speaking Stata: Paired, parallel, or profile plots for changes, correlations, and other comparisons
    _Stata Journal_ 9(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software

------------------------------------------------------------
  Showing 10 of 69 results.
  To see all results, add option: allresults
  Example: findsj panel data, allresults
------------------------------------------------------------

------------------------------------------------------------
  Search completed. Found 69 article(s).
  To view full search results online: Open in browser
------------------------------------------------------------


. 
. ********************************************************************************
. * Example 3: Search in title only
. ********************************************************************************
. dis _n(2) "{bf:Example 3: Search 'panel data' in title only}"


Example 3: Search 'panel data' in title only

. findsj panel data, title

------------------------------------------------------------
  Searching Stata Journal articles...
  Keywords: panel data
  Search by: title
------------------------------------------------------------

Found 25 article(s).

------------------------------------------------------------
  Search Results (Showing 5 of 25)
------------------------------------------------------------

[1] J. L. Gallup. (2020). 
    Added-variable plots for panel-data estimation
    _Stata Journal_ 20(1)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[2] D. M. Drukker. (2003). 
    Testing for serial correlation in linear panel-data models
    _Stata Journal_ 3(2)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[3] J. L. Blackwell, III. (2005). 
    Estimation and testing of fixed-effect panel-data systems
    _Stata Journal_ 5(2)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[4] G. S. F. Bruno. (2005). 
    Estimation and inference in dynamic unbalanced panel-data models with a small number of individuals
    _Stata Journal_ 5(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[5] R. E. De Hoyos and V. Sarafidis. (2006). 
    Testing for cross-sectional dependence in panel-data models
    _Stata Journal_ 6(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software

------------------------------------------------------------
  Showing 5 of 25 results.
  To see all results, add option: allresults
  Example: findsj panel data, allresults
------------------------------------------------------------

------------------------------------------------------------
  Search completed. Found 25 article(s).
  To view full search results online: Open in browser
------------------------------------------------------------


. 
. ********************************************************************************
. * Example 4: Search by author
. ********************************************************************************
. dis _n(2) "{bf:Example 4: Search articles by author 'Baum'"


{bf:Example 4: Search articles by author 'Baum'

. findsj Baum, author

------------------------------------------------------------
  Searching Stata Journal articles...
  Keywords: Baum
  Search by: author
------------------------------------------------------------

Found 24 article(s).

------------------------------------------------------------
  Search Results (Showing 5 of 24)
------------------------------------------------------------

[1] C. F. Baum. (2007). 
    Stata tip 40: Taking care of business
    _Stata Journal_ 7(1)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[2] C. F. Baum and N. J. Cox. (2007). 
    Stata tip 45: Getting those data into shape
    _Stata Journal_ 7(2)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[3] C. F. Baum. (2009). 
    Stata tip 73: append with care!
    _Stata Journal_ 9(1)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[4] C. F. Baum and S. Bibo. (2016). 
    Stata tip 126: Handling irregularly spaced high-frequency transactions data
    _Stata Journal_ 16(2)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[5] C. F. Baum. (2006). 
    Stata tip 37: And the last shall be first
    _Stata Journal_ 6(4)
    Article page | [PDF] | [Google]

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software

------------------------------------------------------------
  Showing 5 of 24 results.
  To see all results, add option: allresults
  Example: findsj Baum, allresults
------------------------------------------------------------

------------------------------------------------------------
  Search completed. Found 24 article(s).
  To view full search results online: Open in browser
------------------------------------------------------------


. 
. ********************************************************************************
. * Example 5: Get DOI information
. ********************************************************************************
. dis _n(2) "{bf:Example 5: Search with DOI information}"


Example 5: Search with DOI information

. findsj panel data, n(5) getdoi

------------------------------------------------------------
  Searching Stata Journal articles...
  Keywords: panel data
  Search by: keyword
------------------------------------------------------------

Found 69 article(s).

------------------------------------------------------------
  Search Results (Showing 5 of 69)
------------------------------------------------------------

[1] N. J. Cox. (2007). 
    Speaking Stata: Identifying spells
    _Stata Journal_ 7(2)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X0700700209

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[2] P. W. Jeanty. (2010). 
    Using the world development indicators database for statistical analysis in Stata
    _Stata Journal_ 10(1)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1001000105

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[3] P. W. Jeanty. (2011). 
    Managing the U.S. Census 2000 and World Development Indicators databases for statistical analysis in Stata
    _Stata Journal_ 11(4)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1201100406

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[4] P. Wilner Jeanty. (2013). 
    Dealing with identifier variables in data management and analysis
    _Stata Journal_ 13(4)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1301300403

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[5] N. J. Cox. (2016). 
    Speaking Stata: Truth, falsity, indication, and negation
    _Stata Journal_ 16(1)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1601600117

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software

------------------------------------------------------------
  Showing 5 of 69 results.
  To see all results, add option: allresults
  Example: findsj panel data, allresults
------------------------------------------------------------

------------------------------------------------------------
  Search completed. Found 69 article(s).
  To view full search results online: Open in browser
------------------------------------------------------------


. 
. ********************************************************************************
. * Example 6: Export citations (plain format to clipboard)
. ********************************************************************************
. dis _n(2) "{bf:Example 6: Export top 5 results in plain format}"


Example 6: Export top 5 results in plain format

. findsj panel data, n(5) plain

------------------------------------------------------------
  Searching Stata Journal articles...
  Keywords: panel data
  Search by: keyword
  Export format:   plain
------------------------------------------------------------

Found 69 article(s).

------------------------------------------------------------
  Search Results (Showing 5 of 69)
------------------------------------------------------------

[1] N. J. Cox. (2007). 
    Speaking Stata: Identifying spells
    _Stata Journal_ 7(2)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X0700700209

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[2] P. W. Jeanty. (2010). 
    Using the world development indicators database for statistical analysis in Stata
    _Stata Journal_ 10(1)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1001000105

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[3] P. W. Jeanty. (2011). 
    Managing the U.S. Census 2000 and World Development Indicators databases for statistical analysis in Stata
    _Stata Journal_ 11(4)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1201100406

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[4] P. Wilner Jeanty. (2013). 
    Dealing with identifier variables in data management and analysis
    _Stata Journal_ 13(4)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1301300403

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[5] N. J. Cox. (2016). 
    Speaking Stata: Truth, falsity, indication, and negation
    _Stata Journal_ 16(1)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1601600117

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software

------------------------------------------------------------
  Showing 5 of 69 results.
  To see all results, add option: allresults
  Example: findsj panel data, allresults
------------------------------------------------------------

â†’ Citations copied to clipboard in   plain format.
  (Copied 5 of 69 results. Use allresults to copy all)

------------------------------------------------------------
  Search completed. Found 69 article(s).
  To view full search results online: Open in browser
------------------------------------------------------------


. 
. ********************************************************************************
. * Example 7: Export citations (markdown format to clipboard)
. ********************************************************************************
. dis _n(2) "{bf:Example 7: Export top 5 results in markdown format}"


Example 7: Export top 5 results in markdown format

. findsj panel data, n(5) markdown

------------------------------------------------------------
  Searching Stata Journal articles...
  Keywords: panel data
  Search by: keyword
  Export format: markdown  
------------------------------------------------------------

Found 69 article(s).

------------------------------------------------------------
  Search Results (Showing 5 of 69)
------------------------------------------------------------

[1] N. J. Cox. (2007). 
    Speaking Stata: Identifying spells
    _Stata Journal_ 7(2)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X0700700209

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[2] P. W. Jeanty. (2010). 
    Using the world development indicators database for statistical analysis in Stata
    _Stata Journal_ 10(1)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1001000105

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[3] P. W. Jeanty. (2011). 
    Managing the U.S. Census 2000 and World Development Indicators databases for statistical analysis in Stata
    _Stata Journal_ 11(4)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1201100406

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[4] P. Wilner Jeanty. (2013). 
    Dealing with identifier variables in data management and analysis
    _Stata Journal_ 13(4)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1301300403

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[5] N. J. Cox. (2016). 
    Speaking Stata: Truth, falsity, indication, and negation
    _Stata Journal_ 16(1)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1601600117

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software

------------------------------------------------------------
  Showing 5 of 69 results.
  To see all results, add option: allresults
  Example: findsj panel data, allresults
------------------------------------------------------------

â†’ Citations copied to clipboard in markdown   format.
  (Copied 5 of 69 results. Use allresults to copy all)

------------------------------------------------------------
  Search completed. Found 69 article(s).
  To view full search results online: Open in browser
------------------------------------------------------------


. 
. ********************************************************************************
. * Example 8: Export citations (latex format to clipboard)
. ********************************************************************************
. dis _n(2) "{bf:Example 8: Export top 5 results in latex format}"


Example 8: Export top 5 results in latex format

. findsj panel data, n(5) latex

------------------------------------------------------------
  Searching Stata Journal articles...
  Keywords: panel data
  Search by: keyword
  Export format:  latex 
------------------------------------------------------------

Found 69 article(s).

------------------------------------------------------------
  Search Results (Showing 5 of 69)
------------------------------------------------------------

[1] N. J. Cox. (2007). 
    Speaking Stata: Identifying spells
    _Stata Journal_ 7(2)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X0700700209

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[2] P. W. Jeanty. (2010). 
    Using the world development indicators database for statistical analysis in Stata
    _Stata Journal_ 10(1)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1001000105

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[3] P. W. Jeanty. (2011). 
    Managing the U.S. Census 2000 and World Development Indicators databases for statistical analysis in Stata
    _Stata Journal_ 11(4)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1201100406

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[4] P. Wilner Jeanty. (2013). 
    Dealing with identifier variables in data management and analysis
    _Stata Journal_ 13(4)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1301300403

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software
[5] N. J. Cox. (2016). 
    Speaking Stata: Truth, falsity, indication, and negation
    _Stata Journal_ 16(1)
    Article page | [PDF] | [Google]
    DOI: 10.1177/1536867X1601600117

    ðŸ“š Citation: BibTeX | RIS

    Search for package | Browse SJ software

------------------------------------------------------------
  Showing 5 of 69 results.
  To see all results, add option: allresults
  Example: findsj panel data, allresults
------------------------------------------------------------

â†’ Citations copied to clipboard in  latex  format.
  (Copied 5 of 69 results. Use allresults to copy all)

------------------------------------------------------------
  Search completed. Found 69 article(s).
  To view full search results online: Open in browser
------------------------------------------------------------


. 
. ********************************************************************************
. * Summary
. ********************************************************************************
. dis _n(2) "{hline 80}"


--------------------------------------------------------------------------------

. dis "EXAMPLES COMPLETED"
EXAMPLES COMPLETED

. dis "{hline 80}"
--------------------------------------------------------------------------------

. dis _n "Available options:"

Available options:

. dis "  - n(#)        : Limit number of results"
  - n(#)        : Limit number of results

. dis "  - title       : Search in title only"
  - title       : Search in title only

. dis "  - author      : Search by author name"
  - author      : Search by author name

. dis "  - getdoi      : Retrieve DOI information (slower)"
  - getdoi      : Retrieve DOI information (slower)

. dis "  - plain       : Export citations in plain format"
  - plain       : Export citations in plain format

. dis "  - markdown    : Export citations in markdown format"
  - markdown    : Export citations in markdown format

. dis "  - latex       : Export citations in LaTeX format"
  - latex       : Export citations in LaTeX format

. dis _n "For each result, you can:"

For each result, you can:

. dis "  - Click BibTeX/RIS links to download citation files"
  - Click BibTeX/RIS links to download citation files

. dis "  - Click article links to view in browser"
  - Click article links to view in browser

. dis "{hline 80}" _n
--------------------------------------------------------------------------------


. 
. log close
      name:  <unnamed>
       log:  d:\User\private\Desktop\stata\findsj_v3\findsj_examples.log
  log type:  text
 closed on:  22 Oct 2025, 15:47:27
---------------------------------------------------------------------------------------------------------------------------
